


//═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                                                                     //
//                                                       ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ ＢＥＴＡ ２                                                           //
//                                                                                                                                                     //
//                                                                    Ｖ：１．０．１                                                                     //
//                                                                                                                                                     //
//                                                       ▄▀█ █░░ █ █▀▀ █▄░█   ▄▀█ █░░ █▀▀ ▄▀█                                                          //
//                                                       █▀█ █▄▄ █ ██▄ █░▀█   █▀█ █▄▄ █▀░ █▀█                                                          //
//                                                                                                                                                     //
//                                                                                                                                                     //
//═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════//





// Obfuscated By AlienAlfa


/**
 * //═══════════[ Thanks To ]══════════════//
 * 
 * Alien-Alfa.
 * //════════════════════════════//
*/

// CURRENTLY RUNNING ON BETA VERSION!!
/**
   * MIT License
* 
   * Create By Dika Ardnt.
   * Edited By Xeon Bot Inc.
   * Modified By Alien-Alfa
   * © 2022 Alien-Alfa.
* 
   * Permission is hereby granted, free of charge, to any person obtaining a copy
   * of this software and associated documentation files (the "Software"), to deal
   * in the Software without restriction, including without limitation the rights
   * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
   * copies of the Software, and to permit persons to whom the Software is
   * furnished to do so, subject to the following conditions:
* 
   * The above copyright notice and this permission notice shall be included in all
   * copies or substantial portions of the Software.
* 
   * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
   * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
   * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
   * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
   * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
   * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
   * SOFTWARE.
*/







exports.active = 'ഇതിനകം സജീവമാക്കി'


exports.inactive = 'ഇതിനകം പ്രവർത്തനരഹിതമാക്കിയിരിക്കുന്നു'


 exports.mess = {
success: 'ചെയ്തു ✓',
admin: 'ഈ ഫീച്ചർ അഡ്മിന് മാത്രമുള്ളതാണ്!',
botAdmin: 'ബോട്ട് ആദ്യം അഡ്മിൻ ആയിരിക്കണം!',
owner: 'ഈ ഫീച്ചർ ഉടമയ്ക്ക് മാത്രമുള്ളതാണ്!',
group: 'ഫീച്ചർ ഗ്രൂപ്പുകൾക്ക് മാത്രം ഉപയോഗിക്കുന്നു!',
private: 'സ്വകാര്യ ചാറ്റിന് മാത്രം ഉപയോഗിക്കുന്ന ഫീച്ചറുകൾ!',
bot: 'ഈ ഫീച്ചർ ബോട്ടിന് മാത്രമുള്ളതാണ്',
wait: 'പ്രക്രിയയിലാണ്...',
linkm: 'ലിങ്ക് എവിടെയാണ്?',
error: 'പിശക്!!',
endLimit: 'നിങ്ങളുടെ പ്രതിദിന പരിധി കാലഹരണപ്പെട്ടു, ഓരോ 12 മണിക്കൂറിലും പരിധി പുനഃസജ്ജമാക്കും',
ban: 'നിങ്ങളെ ഉടമ നിരോധിച്ചിരിക്കുന്നു, നിങ്ങൾക്ക് നിരോധനം ഒഴിവാക്കണമെങ്കിൽ, ചാറ്റ് ഉടമ.',
nsfw: 'nsfw ഫീച്ചർ സജീവമാക്കിയിട്ടില്ല, സജീവമാക്കാൻ അഡ്മിനെ ബന്ധപ്പെടുക',
banChat: 'ഈ ഗ്രൂപ്പിൽ ബോട്ട് നിരോധിച്ചിരിക്കുന്നു, നിരോധനം മാറ്റാൻ ഉടമയെ ബന്ധപ്പെടുക'
}

//=============================================================================================================================================================


//  AntiLink  \\

 exports.antilinkon  = {
    
    group: 'ഈ ഗ്രൂപ്പിൽ ഗ്രൂപ്പ് ചാറ്റ് ആന്റിലിങ്ക് ഓണാക്കുന്നതിൽ വിജയിച്ചു',
    youtube: 'ഈ ഗ്രൂപ്പിൽ യൂട്യൂബ് വീഡിയോ ആന്റിലിങ്ക് ഓണാക്കുന്നതിൽ വിജയിച്ചു',
    youtubech: 'ഈ ഗ്രൂപ്പിൽ യൂട്യൂബ് ചാനൽ ആന്റിലിങ്ക് ഓണാക്കുന്നതിൽ വിജയിച്ചു',
    instagram: 'ഈ ഗ്രൂപ്പിൽ ഇൻസ്റ്റാഗ്രാം ആന്റിലിങ്ക് ഓണാക്കുന്നതിൽ വിജയിച്ചു',
    facebook: 'ഈ ഗ്രൂപ്പിൽ facebook ആന്റിലിങ്ക് ഓണാക്കുന്നതിൽ വിജയിച്ചു',
    telegram: 'ഈ ഗ്രൂപ്പിൽ ടെലിഗ്രാം ആന്റിലിങ്ക് ഓണാക്കുന്നതിൽ വിജയിച്ചു',
    tiktok: 'ഈ ഗ്രൂപ്പിൽ ടിക് ടോക്ക് ആന്റിലിങ്ക് ഓണാക്കുന്നതിൽ വിജയിച്ചു',
    twitter: 'ഈ ഗ്രൂപ്പിൽ ട്വിറ്റർ ആന്റിലിങ്ക് ഓണാക്കുന്നതിൽ വിജയിച്ചു',
    all: 'ഈ ഗ്രൂപ്പിലെ എല്ലാ ആന്റിലിങ്കുകളും ഓണാക്കുന്നതിൽ വിജയിച്ചു'
}



 exports.antilinkwarn  = {
    
    group: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nനിങ്ങൾ ഒരു അഡ്മിൻ അല്ലെങ്കിൽ, ഈ ഗ്രൂപ്പിൽ ഗ്രൂപ്പ് ചാറ്റ് ലിങ്ക് അയയ്‌ക്കരുത് അല്ലെങ്കിൽ നിങ്ങളെ ഉടനടി പുറത്താക്കും!`,
    youtube: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nനിങ്ങൾ ഒരു അഡ്മിൻ അല്ലെങ്കിൽ, ഈ ഗ്രൂപ്പിൽ യൂട്യൂബ് ലിങ്ക് അയയ്‌ക്കരുത്, അല്ലെങ്കിൽ നിങ്ങളെ ഉടൻ പുറത്താക്കും!`,
    youtubech: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nനിങ്ങൾ ഒരു അഡ്മിൻ അല്ലെങ്കിൽ, ഈ ഗ്രൂപ്പിൽ യൂട്യൂബ് ചാനൽ ലിങ്ക് അയയ്‌ക്കരുത് അല്ലെങ്കിൽ നിങ്ങളെ ഉടനടി പുറത്താക്കും!`,
    instagram: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nനിങ്ങൾ ഒരു അഡ്മിൻ അല്ലെങ്കിൽ, ഈ ഗ്രൂപ്പിൽ instagram ലിങ്ക് അയയ്‌ക്കരുത് അല്ലെങ്കിൽ നിങ്ങളെ ഉടനടി പുറത്താക്കും!`,
    facebook: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nനിങ്ങൾ ഒരു അഡ്മിൻ അല്ലെങ്കിൽ, ഈ ഗ്രൂപ്പിൽ facebook ലിങ്ക് അയയ്‌ക്കരുത്, അല്ലെങ്കിൽ നിങ്ങളെ ഉടൻ പുറത്താക്കും!`,
    telegram: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nനിങ്ങൾ ഒരു അഡ്മിൻ അല്ലെങ്കിൽ, ഈ ഗ്രൂപ്പിൽ ടെലിഗ്രാം ലിങ്ക് അയയ്‌ക്കരുത്, അല്ലെങ്കിൽ നിങ്ങളെ ഉടൻ പുറത്താക്കും!`,
    tiktok: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nനിങ്ങൾ ഒരു അഡ്മിൻ അല്ലെങ്കിൽ, ഈ ഗ്രൂപ്പിൽ ടിക് ടോക്ക് ലിങ്ക് അയയ്‌ക്കരുത് അല്ലെങ്കിൽ നിങ്ങളെ ഉടൻ തന്നെ പുറത്താക്കും!`,
    twitter: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nനിങ്ങൾ ഒരു അഡ്മിൻ അല്ലെങ്കിൽ, ഈ ഗ്രൂപ്പിൽ ട്വിറ്റർ ലിങ്ക് അയയ്‌ക്കരുത് അല്ലെങ്കിൽ നിങ്ങളെ ഉടനടി പുറത്താക്കും!`,
    all: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nനിങ്ങൾ ഒരു അഡ്മിൻ അല്ലെങ്കിൽ, ഈ ഗ്രൂപ്പിൽ ഒരു ലിങ്കും അയയ്‌ക്കരുത് അല്ലെങ്കിൽ നിങ്ങളെ ഉടനടി പുറത്താക്കും!`
}



 exports.antilinkoff  = {
    group: 'ഈ ഗ്രൂപ്പിലെ ഗ്രൂപ്പ് ചാറ്റ് ആന്റിലിങ്ക് ഓഫാക്കുന്നതിൽ വിജയിച്ചു',
    youtube: 'ഈ ഗ്രൂപ്പിലെ യൂട്യൂബ് വീഡിയോ ആന്റിലിങ്ക് ഓഫാക്കുന്നതിൽ വിജയിച്ചു',
    youtubech: 'ഈ ഗ്രൂപ്പിലെ യൂട്യൂബ് ചാനൽ ആന്റിലിങ്ക് ഓഫാക്കുന്നതിൽ വിജയിച്ചു',
    instagram: 'ഈ ഗ്രൂപ്പിലെ ഇൻസ്റ്റാഗ്രാം ആന്റിലിങ്ക് ഓഫാക്കുന്നതിൽ വിജയിച്ചു',
    facebook: 'ഈ ഗ്രൂപ്പിൽ facebook ആന്റിലിങ്ക് ഓഫ് ചെയ്യുന്നതിൽ വിജയിച്ചു',
    telegram: 'ഈ ഗ്രൂപ്പിലെ ടെലിഗ്രാം ആന്റിലിങ്ക് ഓഫാക്കുന്നതിൽ വിജയിച്ചു',
    tiktok: 'ഈ ഗ്രൂപ്പിൽ ടിക്ടോക്ക് ആന്റിലിങ്ക് ഓഫാക്കുന്നതിൽ വിജയിച്ചു',
    twitter: 'ഈ ഗ്രൂപ്പിലെ ട്വിറ്റർ ആന്റിലിങ്ക് ഓഫാക്കുന്നതിൽ വിജയിച്ചു',
    all: 'ഈ ഗ്രൂപ്പിലെ എല്ലാ ആന്റിലിങ്കുകളും ഓഫാക്കുന്നതിൽ വിജയിച്ചു'
}



//=============================================================================================================================================================


//   Functions   \\
 exports.functionson  = {
    antivirus: 'ഈ ഗ്രൂപ്പിൽ ആന്റിവൈറസ് ഓണാക്കുന്നതിൽ വിജയിച്ചു',
    autoreply: 'ഈ ഗ്രൂപ്പിൽ സ്വയമേവയുള്ള മറുപടി ഓണാക്കുന്നതിൽ വിജയിച്ചു',
    antitoxic: 'ഈ ഗ്രൂപ്പിൽ ആന്റിടോക്സിക് ഓണാക്കുന്നതിൽ വിജയം',
    antiwame: 'ഈ ഗ്രൂപ്പിൽ ആന്റിവേം ഓണാക്കുന്നതിൽ വിജയിച്ചു',
    nsfw: 'ഈ ഗ്രൂപ്പിൽ nsfw ഓണാക്കുന്നതിൽ വിജയിച്ചു'
}


 exports.functionswarn  = {
    antivirus: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nഈ ഗ്രൂപ്പിൽ വൈറസ് അയക്കാൻ ഒരു ശരീരത്തെയും അനുവദനീയമല്ല, അയയ്ക്കുന്ന അംഗത്തെ ഉടൻ തന്നെ ചവിട്ടും!`,
    antitoxic: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nഈ ഗ്രൂപ്പിൽ മോശമായ വാക്കുകൾ ഉപയോഗിക്കാൻ ആരെയും അനുവദിക്കില്ല, ഉപയോഗിക്കുന്നയാളെ ഉടൻ ചവിട്ടും!`,
    antiwame: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nഈ ഗ്രൂപ്പിൽ wa.me അയയ്‌ക്കാൻ ആർക്കും അനുവാദമില്ല, അയയ്‌ക്കുന്ന ഒരാളെ ഉടനടി ചവിട്ടും!`,
    nsfw: `\`\`\`「 ⚠️Warning⚠️ 」\`\`\`\n\nഈ ഗ്രൂപ്പിൽ Nsfw(ജോലിക്ക് സുരക്ഷിതമല്ല) ഫീച്ചർ പ്രവർത്തനക്ഷമമാക്കിയിട്ടുണ്ട്, അതായത് ബോട്ടിൽ നിന്ന് ലൈംഗിക ഗ്രാഫിക്സ് ആക്‌സസ് ചെയ്യാൻ കഴിയും!`
}


 exports.functionsoff  = {
    antivirus: 'ഈ ഗ്രൂപ്പിലെ ആന്റിവൈറസ് ഓഫാക്കുന്നതിൽ വിജയിച്ചു',
    autoreply: 'ഈ ഗ്രൂപ്പിലെ സ്വയമേവയുള്ള മറുപടി ഓഫാക്കുന്നതിൽ വിജയിച്ചു',
    antitoxic: 'ഈ ഗ്രൂപ്പിൽ ആന്റിടോക്സിക് ഓഫ് ചെയ്യുന്നതിൽ വിജയം',
    antiwame: 'ഈ ഗ്രൂപ്പിൽ ആന്റിവാം ഓഫാക്കുന്നതിൽ വിജയിച്ചു',
    nsfw: 'ഈ ഗ്രൂപ്പിൽ nsfw ഓഫാക്കുന്നതിൽ വിജയിച്ചു'
}



//=============================================================================================================================================================

//   Guess  \\

 exports.guess = (prefix,command) => {
unfinished = "പൂർത്തിയാകാത്ത സെഷനുകൾ ഇപ്പോഴും ഉണ്ട്!",
example = `Example : ${prefix + command} പാട്ട്\n\nഓപ്ഷൻ : \n1.song\n2. ചിത്രം\n3. പറയുന്നത്\n4. വാചകം\n5. വരികൾ\n6.ഭക്ഷണം`,
song = `ഈ പാട്ടിന്റെ പേരെന്താണ്?\n\nകലാകാരൻ : ${result.artist}\nസമയം : 60s`,
picture = `മുകളിലുള്ള ചോദ്യത്തിന് ദയവായി ഉത്തരം നൽകുക\n\nവിവരണം : ${result.deskripsi}\nസമയം : 60s`,
word = `ഇനിപ്പറയുന്ന ചോദ്യത്തിന് ദയവായി ഉത്തരം നൽകുക\n\n${result.soal}\nസമയം : 60s`,
sentence = `ഇനിപ്പറയുന്ന ചോദ്യത്തിന് ദയവായി ഉത്തരം നൽകുക\n\n${result.soal}\nസമയം : 60s`,
lyrics = `വിട്ടുപോയ വരികൾ ചുവടെ പൂരിപ്പിക്കുക: *${result.soal}*?\nസമയം : 60s`,
saying = `*ഇനിപ്പറയുന്ന ചോദ്യങ്ങൾക്ക് ഉത്തരം നൽകുക :*\n${result.soal}*\nസമയം : 60s`
}

 exports.guessbutton  = {
    song: 'പാട്ട് ഊഹിക്കുക',
    picture: 'ചിത്രം ഊഹിക്കുക',
    word: 'വാക്ക് ഊഹിക്കുക',
    sentence: 'വാചകം ഊഹിക്കുക',
    lyrics: 'വരികൾ ഊഹിക്കുക',
    saying: 'വചനം ഊഹിക്കുക'
}    

//=============================================================================================================================================================


exports.enableordisable = `ദയവായി താഴെയുള്ള ബട്ടൺ ക്ലിക്ക് ചെയ്യുക\n\nപ്രവർത്തനക്ഷമമാക്കാൻ\nഓഫ് ചെയ്യാൻ ഓഫ് ചെയ്യുക`


 exports.replycaption = (prefix,command) => {
    return `അടിക്കുറിപ്പോടെ ചിത്രം അയയ്‌ക്കുക/മറുപടി നൽകുക ${prefix + command}`
}

 exports.bcerr = (prefix,command) => {
    return `*നിങ്ങൾ പ്രക്ഷേപണം ചെയ്യാൻ ആഗ്രഹിക്കുന്ന വീഡിയോ/ഓഡിയോ/ചിത്രം അടിക്കുറിപ്പോടെ അയയ്‌ക്കുക/മറുപടി നൽകുക* ${prefix + command}`
}

 exports.blocerr = (prefix,command) => {
    return `ഉപയോഗിക്കുക ${prefix}bcloc text\n\nഉദാഹരണം : ${prefix + command} attention everybody`
}

 exports.notbybot = 'സന്ദേശം അയച്ചത് ഒരു ബോട്ടല്ല!'


 exports.mainerr = '*പിശക്*'


 exports.takeresult = `ഇവിടെ ആരംഭിക്കുന്നു!`


 exports.textNext = `അടുത്തത് `


 exports.textbutt1 = 'പിംഗ്'


 exports.textbutt2 = 'മെനു 🐰'


 exports.textbutt3 = 'ഉടമ 😈'


 exports.texturlbutt1 = 'YouTube 🍓'


 exports.texturlbutt2 = 'സ്ക്രിപ്റ്റ് '


 exports.unfinished = "പൂർത്തിയാകാത്ത സെഷനുകൾ ഇപ്പോഴും ഉണ്ട്!"

 exports.stickererr = (prefix,command) => {
    return `അടിക്കുറിപ്പോടെ ചിത്രം/വീഡിയോ അയയ്ക്കുക ${prefix + command}\nവീഡിയോ ദൈർഘ്യം 1-9 സെക്കൻഡ്`
}

 exports.sticviderr = (prefix,command) => {
    return 'പരമാവധി 10 സെക്കൻഡ്!'
}

 exports.replycap = (prefix,command) => {
    return `അടിക്കുറിപ്പോടെ ഫോട്ടോ അയയ്‌ക്കുക/മറുപടി നൽകുക ${prefix + command} *വാചകം*`
}

 exports.textcap = (prefix,command) => {
    return `വാചകത്തിന് അടിക്കുറിപ്പോടെ മറുപടി നൽകുക ${prefix + command}`
} 

 exports.linkerr = "ലിങ്ക് പിശക്!"

 exports.madeby = `ഉണ്ടാക്കിയത്`


 exports.waitamin = `ഏകദേശം 1 മിനിറ്റ് ലോഗോ നിർമ്മിക്കുമ്പോൾ ഒരു നിമിഷം കാത്തിരിക്കുക`


 exports.emojiz = (prefix,command) => {
    return "ഇമോജി നൽകുക, പരമാവധി 1 ഇമോജി, ഉദാ?" + ` ${prefix + command} `
}

 exports.invalidlink = `*നിങ്ങൾ നൽകിയ ലിങ്ക് അസാധുവാണ്*`


 exports.example = `ഉദാഹരണം`

//=============================================================================================================================================================

